# Data Science in Python Pandas, Scikit-learn,Numpy Matplotlib - Video Nr. 15
# Introduction to Dataframe

In [1]:
# DataFrame
# DataFrame ist ein 2-dimensionaler array
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(data = [[2,4,6,-1],[3,-4,2,-1],[-10,3,5,-7]],columns=["c1","c2","c3","c4"], index=["R1","R2","R3"])

In [3]:
df

    c1  c2  c3  c4
R1   2   4   6  -1
R2   3  -4   2  -1
R3 -10   3   5  -7

In [4]:
df.head(2)
# nur die ersten zwei Reihen an Daten werden gezeigt
# standard: ersten 5 Reihen

    c1  c2  c3  c4
R1   2   4   6  -1
R2   3  -4   2  -1

In [5]:
#Hinzuf체gen einer neuen Spalte
df["newC"] = 7
df_2 = df
df_2

    c1  c2  c3  c4  newC
R1   2   4   6  -1     7
R2   3  -4   2  -1     7
R3 -10   3   5  -7     7

In [6]:
# zu jedem Wert in der Spalte c1 wird der Wert 5 addiert
df_2 ["newC"] = df ["c1"] + 5
df_2

    c1  c2  c3  c4  newC
R1   2   4   6  -1     7
R2   3  -4   2  -1     8
R3 -10   3   5  -7    -5

In [7]:
# Entfernung von Spalten (Columns)
df_3 = pd.DataFrame(data = [[2,4,6,-1],[3,-4,2,-1],[-10,3,5,-7]],columns=["c1","c2","c3","c4"], index=["R1","R2","R3"])
df_3["newC"] = df_3 ["c1"] + 5
df_3.drop("newC",axis=1) # danach darf df_3 nicht anzeigen lassen, sonst wird Spalte nicht entfernt

    c1  c2  c3  c4
R1   2   4   6  -1
R2   3  -4   2  -1
R3 -10   3   5  -7

In [8]:
# Entfernung von Reihen
df_3.drop("R1", axis = 0)

    c1  c2  c3  c4  newC
R2   3  -4   2  -1     8
R3 -10   3   5  -7    -5

In [9]:
''' Auch wenn in ich den obigen Beispielen Spalten und Reihen entfernt habe, wird mit df_3 immer noch der gesamte Datensatz 
gezeigt'''
df_3

    c1  c2  c3  c4  newC
R1   2   4   6  -1     7
R2   3  -4   2  -1     8
R3 -10   3   5  -7    -5

In [10]:
#Wenn der drop von newC tats채chlich f체r die variable df_4 dauerhaft sein soll
df_4 = pd.DataFrame(data = [[2,4,6,-1],[3,-4,2,-1],[-10,3,5,-7]],columns=["c1","c2","c3","c4"], index=["R1","R2","R3"])
df_4["newC"] = df_3 ["c1"] + 5
df_4

    c1  c2  c3  c4  newC
R1   2   4   6  -1     7
R2   3  -4   2  -1     8
R3 -10   3   5  -7    -5

In [11]:
df_4.drop("newC", axis=1, inplace=True)
df_4
# funktionert auch f체r R1, dann muss aber axis = 0 sein

    c1  c2  c3  c4
R1   2   4   6  -1
R2   3  -4   2  -1
R3 -10   3   5  -7

In [15]:
df_2

    c1  c2  c3  c4  newC
R1   2   4   6  -1     7
R2   3  -4   2  -1     8
R3 -10   3   5  -7    -5

In [16]:
#Alternativ geht es auch, wenn dem drop eine neue Variable zugeordnet wird
df_5 = df_2.drop("newC", axis=1)
df_5

    c1  c2  c3  c4
R1   2   4   6  -1
R2   3  -4   2  -1
R3 -10   3   5  -7

In [ ]:
# bei 06:38 weitermachen